using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public static class InGameStatisticsCollector
{
    // [!!!] ВАЖНОЕ [!!!]
    /*
        Забыл, пока писал заголовок ...
        А, да, здесь только СТАТИСТИКА
        Переменные для СТАТИСТИКИ
        Хотя можно вообще все переменные собрать и тут же их сохранять
        Звучит неплохо ... О_о 
     */

    // [Статистика уровня]
    /*
        Какой и сколько предметов выкопано
        Сколько раз и кем был пойман
        Сколько и какие бонусы юзал 
        Общее время игры
        Сколько по времени проходил уровень:
            - минимум
            - в среднем
            - максимум
            - последний раз
     */

    // [Статистика общая]
    /*
        Сколько уровней пройдено
        Сколько уровней осталось
        Сколько медалей потрачено
        Сколько медалей заработано
        Сколько энергии потрачено
        Сколько энергии заработано
        Сколько донатов приобретено
        Сколько бонусов потрачено
        Сколько бонусов приобретено
     */

    // Тут будут события сохранения и загрузки данных на текущем уровне

    // Все данные будут идти сюда для статистики, достижений и прочего
}
